package com.maxtree.automotive.dashboard;

/**
 * 
 * @author chens
 *
 */
public enum PermissionCodes {
	 
	A1("A1","管理员","管理员")
	,A2("A2","前台","前台用户")
	,A3("A3","质检","质检用户")
	,A4("A4","审档","审档用户")
	,A5("A5","查询","数据查询用户")
	,A6("A6","上架下架","上架下架用户")
	,B1("B1","更改个人资料","更改个人资料")
	,B2("B2","更改密码","更改密码")
	,C1("C1","创建","创建用户")
	,C2("C2","编辑","编辑用户")
	,C3("C3","删除","删除用户")
	,C4("C4","查看","查看用户列表")
	,C5("C5","分配角色","为用户分配角色")
	,C6("C6","分配业务","为用户分配业务类型")
	,C7("C7","重置密码","为用户重置密码")
	,D1("D1","创建","创建角色")
	,D2("D2","编辑","编辑角色")
	,D3("D3","删除","删除角色")
	,D4("D4","分配用户","为角色分配用户")
	,D5("D5","设置权限","为角色分配权限")
	,D6("D6","查看","查看角色列表")
	,E1("E1","分配角色","为权限分配角色")
	,E2("E2","编辑","编辑权限")
	,E3("E3","查看","查看权限列表")
	,F1("F1","创建","创建机构")
	,F2("F2","编辑","编辑机构")
	,F3("F3","删除","删除机构")
	,F4("F4","分配用户","为机构分配用户")
	,F5("F5","管理库房","管理库房")
	,F6("F6","查看","查看机构列表")
	,F7("F7","设置","设置业务类型")
	,G1("G1","创建","创建社区")
	,G2("G2","编辑","编辑社区")
	,G3("G3","删除","删除社区")
	,G4("G4","分配机构","分配机构")
	,G5("G5","查看","查看社区列表")
	,G6("G6","分配租户","为社区分配数据库租户")
	,G7("G7","分配站点","为社区分配站点")
	,J1("J1","创建","创建租户")
	,J2("J2","编辑","编辑租户")
	,J3("J3","删除","删除租户")
	,J4("J4","查看","查看租户列表")
	,K1("K1","创建","创建站点")
	,K2("K2","编辑","编辑站点")
	,K3("K3","删除","删除站点")
	,K4("K4","查看","查看站点列表")
	,K5("K5","分配社区","为站点分配社区")
	,K6("K6","操作","对站点进行启动/停止/测试连接操作")
	,L1("L1","发送消息","发送消息")
	,L2("L2","查看","查看消息列表")
	,L3("L3","设置","设置定时发送消息")
	,L4("L4","删除","删除消息")
	,M1("M1","创建","创建数据字典")
	,M2("M2","编辑","编辑数据字典")
	,M3("M3","删除","删除数据字典")
	,M4("M4","查看","查看数据字典")
	,N1("N1","创建","创建业务类型")
	,N2("N2","编辑","编辑业务类型")
	,N3("N3","删除","删除业务类型")
	,N4("N4","查看","查看业务类型")
	,N5("N5","设置","设置业务材料")
	,O1("O1","社区级","社区管理员既可以管社区也可以管机构")
	,O2("O2","机构级","机构管理员只允许管机构");
	
	/**
	 * 
	 * @param code
	 * @param name
	 * @param description
	 */
	private PermissionCodes(String code, String name, String description) {
		this.code = code;
		this.name = name;
		this.description = description;
	}
	
	public String code;
	public String name;
	public String description;
}
