1.影像化管理员的表格，显示哪些数据？显示4个列，号牌号码,号牌种类，vin,状态
2.影像化检测，什么逻辑？录入根据纸质档案输入车辆基本信息，质检也是根据纸质输入车辆基本信息，不通过队列，但有质检退回
3.上架下架，操作哪些上架号？上架或下降只是更改业务状态


注意：
1.选管理员角色就不允许选前端角色
2.删除表：denseframe,filebox,portfolio,storehouse
3.前台影像化检测给予提示，点击确定情况stage
4.申请接口的事
5.只做一级审档，和非审档业务


2018-08-24代办任务：
1.把sql文件包装成jar
2.把license manager需要登录验证
3.检查材料录入顺序
4.更改首页背景图像
5.添加注释
6.添加异常信息到log里
7.解决录入时业务累计问题
8.解决反馈消息时字符个数超长问题.[Fixed]
9.去掉登录页面的用户名 [fixed]
10.影像化质检添加打印功能 【Fixed】
11.影像化质检打印中，什么业务打印什么单----注册业务需要打车辆标签和业务标签，其它业务只打业务标签，审核业务必须打审核结果单
12.模拟一个可以配置在外部的接口----


